
&НаКлиенте
Процедура ВыполнитьПроверку(Команда)
	ВыполнитьПроверкуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПроверкуНаСервере()
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Контрагенты.Ссылка КАК Контрагент
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактныеЛицаКонтрагентов КАК КонтактныеЛицаКонтрагентов
	|		ПО Контрагенты.Ссылка = КонтактныеЛицаКонтрагентов.Контрагент
	|ГДЕ
	|	Контрагенты.ЭтоГруппа = ЛОЖЬ
	|	И КонтактныеЛицаКонтрагентов.Контрагент ЕСТЬ NULL";
	
	Выборка = Запрос.Выполнить().Выгрузить();
	
	Объект.СписокКонтрагентов.Загрузить(Выборка);
	
КонецПроцедуры
